Revit 2024 API
DistributionSysType.ElectricalPhase Property
 Get or set electrical phase (single, triple or undefined) of distribution system.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ElectricalPhase ElectricalPhase { get; set; }
Visual Basic
Public Property ElectricalPhase As ElectricalPhase
	Get
	Set
Visual C++
public:
property ElectricalPhase ElectricalPhase {
	ElectricalPhase get ();
	void set (ElectricalPhase value);
}
See Also
DistributionSysType Class
Autodesk.Revit.DB.Electrical Namespace